movie-base/app/controllers/film_casts_controller.rb

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @film = Film.find(params[:film_id])