movie-base/app/controllers/films_controller.rb

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_film
    @film = Film.find(params[:id])