movie-base/app/controllers/sources_controller.rb

  def index
    @sources = Source.all
---
SELECT "sources".* FROM "sources"

  def set_source
    @source = Source.find(params[:id])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]