movie-base/app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Updated Name"], ["updated_at", "2024-02-26 18:20:15.809118"], ["id", 1]]
---
  def update
    if @user.update(user_params)